tap "homebrew/bundle"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Command-line interface for SQLite
brew "sqlite"
# Extraction utility for .zip compressed archives
brew "unzip"
# Python code formatter
brew "black"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Reimplementation of ctags(1)
brew "ctags"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc@9"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Multi-threaded malloc() and performance analysis tools
brew "gperftools"
# X.Org: Inter-Client Exchange Library
brew "libice"
# X.Org: X Session Management Library
brew "libsm"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Program providing model for GNU coding standards and practices
brew "hello"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Utility for directing compilation
brew "make"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Generate scripting interfaces to C/C++ code
brew "swig"
# JavaScript package manager
brew "yarn"
# High-performance theorem prover
brew "z3"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"