tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
tap "sunnyyoung/repo"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# DOSBox with accurate emulation and wide testing
brew "dosbox-x"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Next-gen compiler infrastructure
brew "llvm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Emulator for x86 and PowerPC
brew "qemu"
# Format Rust code
brew "rustfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Intelligent cloud storage platform
cask "adrive"
# E-books management software
cask "calibre"
# Online diagram software
cask "drawio"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File system integration
cask "macfuse"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Utility to open, create and modify archive files
cask "maczip"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Remote desktop client
cask "microsoft-remote-desktop"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Open-source software for live streaming and screen recording
cask "obs"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Tool for uploading images
cask "picgo"
# Instant messaging tool
cask "qq"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Cloud video conferencing
cask "tencent-meeting"
# Multi-platform VNC client and server
cask "tigervnc-viewer"
# Collection of tools to build a dedicated basic communication network
cask "v2rayu"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Free messaging and calling application
cask "wechat"
# A command line utility to work with WeChatTweak-macOS.
cask "wechattweak-cli"
